Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/legal_aid_and_advice/garda_station_legal_advice_scheme.html.txt.tmx
Source language: en
Languages: ga

source: Garda Station Legal Advice Revised Scheme
ga: Scéim Leasaithe um Chomhairle Dlí Stáisiún an Gharda Síochána

source: Under the Garda Station Legal Advice Revised Scheme, free legal advice can be provided to those detained under certain legislation in Garda stations, providing they satisfy a means test
ga: Faoi Scéim Leasaithe um Chomhairle Dlí Stáisiún an Gharda Síochána, is féidir comhairle dlí shaor in aisce a chur ar fáil dóibh siúd atá faoi choinneáil faoi reachtaíocht áirithe i stáisiúin an Gharda Síochána, a fhad agus a shásaíonn siad tástáil mhaoine

source: The Minister for Justice and Equality established the original Garda Station Legal Advice Scheme in 2001
ga: Bhunaigh an tAire Dlí agus Cirt an scéim bunaidh i 2001

source: In 2011, the Legal Aid Board took over responsibility for the administration of the scheme
ga: I 2011, ghlac an Bord Cúnamh Dlí leis an bhfreagracht as riaradh na scéime

source: The Garda Station Legal Advice Revised Scheme commenced on 15 August 2014 and replaced the original scheme
ga: Cuireadh tús leis an Scéim Leasaithe um Chomhairle Dlí Stáisiún an Gharda Síochána i mí Lúnasa 2014 agus in ionad an scéim bhunaidh

source: The Garda Station Legal Advice Revised Scheme applies to those detained in a Garda station in relation to the investigation of certain types of offences
ga: Baineann Scéim Leasaithe um Chomhairle Dlí Stáisiún an Gharda Síochána leo siúd atá faoi choinneáil i stáisiún an Gharda Síochána maidir le himscrúdú a dhéanamh ar shaghsanna áirithe de chionta

source: You must be legally entitled to consult a solicitor and you must be unable to pay for the consultation yourself
ga: Ní mór duit bheith i dteideal go dlíthiúil chun dul i gcomhairle le haturnae agus gan bheith in ann íoc as an gcomhairliúchán tú féin

source: The offences the scheme applies to are:
ga: Is iad na cionta lena mbaineann an scéim:

source: • Offences under Section 30 of the Offences Against the State Act 1939 as amended
ga: • Cionta faoi Alt 30 den Acht um Chionta in Aghaidh an Stáit, 1939 arna leasú

source: • Offences under Section 4 of the Criminal Justice Act 1984
ga: • Cionta faoi Alt 4 den Acht um Cheartas Coiriúil, 1984

source: • Offences under Section 2 of the Criminal Justice (Drug Trafficking) Act 1996
ga: • Cionta faoi Alt 2 den Acht um Cheartas Coiriúil (Gáinneáil Drugaí), 1996

source: • Offences under Section 50 of the Criminal Justice Act 2007
ga: • Cionta faoi Alt 50 den Acht um Cheartas Coiriúil, 2007

source: Those detained under Sections 16 and 17 of the Criminal Procedures Act 2010 or Section 42 of the Criminal Justice Act 1999 can also apply for legal advice under the scheme as if detained under Section 4 of the Criminal Justice Act 1984
ga: Ina theannta sin, is féidir leo siúd atá faoi choinneáil faoi Ailt 16 agus 17 den Acht um Nósanna Imeachta Coiriúla, 2010 nó Alt 42 den Acht um Cheartas Coiriúil, 1999 iarratas a dhéanamh ar chomhairle dlí faoin scéim amhail is dá mba faoi choinneáil faoi Alt 4 den Acht um Cheartas Coiriúil 1984

source: Under the scheme, fees are paid to a solicitor for:
ga: Faoin scéim, táillí a íoctar le aturnae le haghaidh:

source: • Telephone and in-station consultations
ga: • Teileafón agus in-stáisiún comhairliúcháin

source: • Attendance of the solicitor at a formal interview between the Gardaí and the detainee
ga: • Freastal ar an aturnae ag agallamh foirmiúil idir na Gardaí agus an choinneáil

source: • Attendance of the solicitor at an identity parade
ga: • Freastal ar an aturnae ag paráid aitheantais

source: The number of consultations the scheme will cover you for depends on the legislation you are detained under
ga: Braitheann an líon comhairliúchán a chuimseoidh an scéim duit ar an reachtaíocht faoinar coinneáladh thú

source: The scheme also covers payments to a solicitor who attends an extension hearing held in the District Court where the Gardaí apply to extend the time limit for holding a suspect under the Offences Against the State Acts, under the Criminal Justice (Drug Trafficking) Act 1996 or under the Criminal Justice Act 2007
ga: Cuimsíonn an scéim íocaíochtaí le haturnae a fhreastalaíonn ar éisteacht sínte a chuirtear ar bun sa Chúirt Dúiche sa chás go ndéanann na Gardaí iarratas chun an teorainn ama a shíneadh chun duine a bhfuiltear in amhras orthu a choinneáil faoi na hAchtanna um Chionta in Aghaidh an Stáit, faoin Acht um Cheartas Coiriúil (Gainneáil Drugaí), 1996 nó faoin Acht um Cheartas Coiriúil, 2007

source: The scheme covers the cost of consultations with a solicitor if you cannot afford to pay for the solicitor
ga: Cuimsíonn an scéim costas comhairliúchán le haturnae murar féidir leat íoc as an aturnae

source: When you apply you will have to complete a statement of means
ga: Nuair a dhéanann tú iarratas, beidh ort ráiteas maoine a chomhlánú

source: The scheme is confined to those who are in receipt of social welfare payments and those whose annual earnings are less than €20,316
ga: Tá an scéim teoranta dóibh siúd a fhaigheann íocaíochtaí leasa shóisialaigh agus dóibh siúd a bhfuil a dtuillimh níos lú ná €20,316

source: If you are detained in a Garda station and want to apply for the scheme you should complete form GLAS 2 (pdf)
ga: Má tá tú á choinneáil i stáisiún an Gharda Síochána agus más mian leat iarratas a dhéanamh ar an scéim, ba cheart duit foirm GLAS 2 (pdf) a chomhlánú

source: The form is available in Garda stations, from your solicitor and from the Criminal Legal Aid Section of the Legal Aid Board
ga: Tá fáil ar an bhfoirm ó stáisiúin an Gharda Síochána, ó d’aturnae agus ó Rannóg um Chúnamh Coiriúil Dlí den Bhord Cúnamh Dlí

source: Your solicitor submits his/her claim for fees at the end of the detention period to the Legal Aid Board
ga: Déanann d’aturnae a (h)éileamh ar tháillí a chur ar aghaidh ag deireadh na tréimhse coinneála chuig an mBord Cúnamh Dlí

source: Further information on the scheme is available on the Legal Aid Board's website
ga: Tá fáil ar thuilleadh faisnéise ar an scéim ar láithreán gréasáin an Bhoird Chúnaimh Dlí
